QA stuff/4 Web Services testing/Lecture 5/result/SmokeTests-Property_step_example-GetWeatherByZIP_Use_propery_in_request_and_in_xpath_assert-0-OK.txt

Status: OK
Time Taken: 879
Size: 2622
Timestamp: Mon May 30 01:04:41 EEST 2016
TestStep: GetWeatherByZIP (Use propery in request and in xpath assert)

----------------- Messages ------------------------------

----------------- Properties ------------------------------
Encoding: UTF-8
Endpoint: http://wsf.cdyne.com/WeatherWS/Weather.asmx

---------------- Request ---------------------------
Request Headers: Host : wsf.cdyne.com
Content-Length : 317
Accept-Encoding : gzip,deflate
User-Agent : Apache-HttpClient/4.1.1 (java 1.5)
Connection : Keep-Alive
Content-Type : application/soap+xml;charset=UTF-8;action="http://ws.cdyne.com/WeatherWS/GetCityForecastByZIP"


<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:weat="http://ws.cdyne.com/WeatherWS/">
   <soap:Header/>
   <soap:Body>
      <weat:GetCityForecastByZIP>
         <!--Optional:-->
         <weat:ZIP>90001</weat:ZIP>
      </weat:GetCityForecastByZIP>
   </soap:Body>
</soap:Envelope>

---------------- Response --------------------------
Response Headers: X-AspNet-Version : 2.0.50727
Date : Sun, 29 May 2016 22:04:36 GMT
#status# : HTTP/1.1 200 OK
Content-Length : 2622
Expires : -1
Content-Type : application/soap+xml; charset=utf-8
X-Powered-By : ASP.NET
Server : Microsoft-IIS/7.5
Pragma : no-cache
Cache-Control : no-cache


<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
   <soap:Body>
      <GetCityForecastByZIPResponse xmlns="http://ws.cdyne.com/WeatherWS/">
         <GetCityForecastByZIPResult>
            <Success>true</Success>
            <ResponseText>City Found</ResponseText>
            <State>CA</State>
            <City>Los Angeles</City>
            <WeatherStationCity>Long Beach</WeatherStationCity>
            <ForecastResult>
               <Forecast>
                  <Date>2014-09-30T00:00:00</Date>
                  <WeatherID>4</WeatherID>
                  <Desciption>Sunny</Desciption>
                  <Temperatures>
                     <MorningLow/>
                     <DaytimeHigh>82</DaytimeHigh>
                  </Temperatures>
                  <ProbabilityOfPrecipiation>
                     <Nighttime/>
                     <Daytime>00</Daytime>
                  </ProbabilityOfPrecipiation>
               </Forecast>
               <Forecast>
                  <Date>2014-10-01T00:00:00</Date>
                  <WeatherID>2</WeatherID>
                  <Desciption>Partly Cloudy</Desciption>
                  <Temperatures>
                     <MorningLow>63</MorningLow>
                     <DaytimeHigh>79</DaytimeHigh>
                  </Temperatures>
                  <ProbabilityOfPrecipiation>
                     <Nighttime>00</Nighttime>
                     <Daytime>00</Daytime>
                  </ProbabilityOfPrecipiation>
               </Forecast>
               <Forecast>
                  <Date>2014-10-02T00:00:00</Date>
                  <WeatherID>4</WeatherID>
                  <Desciption>Sunny</Desciption>
                  <Temperatures>
                     <MorningLow>62</MorningLow>
                     <DaytimeHigh>94</DaytimeHigh>
                  </Temperatures>
                  <ProbabilityOfPrecipiation>
                     <Nighttime>00</Nighttime>
                     <Daytime>00</Daytime>
                  </ProbabilityOfPrecipiation>
               </Forecast>
               <Forecast>
                  <Date>2014-10-03T00:00:00</Date>
                  <WeatherID>4</WeatherID>
                  <Desciption>Sunny</Desciption>
                  <Temperatures>
                     <MorningLow>63</MorningLow>
                     <DaytimeHigh>97</DaytimeHigh>
                  </Temperatures>
                  <ProbabilityOfPrecipiation>
                     <Nighttime>00</Nighttime>
                     <Daytime>00</Daytime>
                  </ProbabilityOfPrecipiation>
               </Forecast>
               <Forecast>
                  <Date>2014-10-04T00:00:00</Date>
                  <WeatherID>4</WeatherID>
                  <Desciption>Sunny</Desciption>
                  <Temperatures>
                     <MorningLow>64</MorningLow>
                     <DaytimeHigh>99</DaytimeHigh>
                  </Temperatures>
                  <ProbabilityOfPrecipiation>
                     <Nighttime>00</Nighttime>
                     <Daytime>00</Daytime>
                  </ProbabilityOfPrecipiation>
               </Forecast>
               <Forecast>
                  <Date>2014-10-05T00:00:00</Date>
                  <WeatherID>4</WeatherID>
                  <Desciption>Sunny</Desciption>
                  <Temperatures>
                     <MorningLow>64</MorningLow>
                     <DaytimeHigh>90</DaytimeHigh>
                  </Temperatures>
                  <ProbabilityOfPrecipiation>
                     <Nighttime>00</Nighttime>
                     <Daytime>00</Daytime>
                  </ProbabilityOfPrecipiation>
               </Forecast>
               <Forecast>
                  <Date>2014-10-06T00:00:00</Date>
                  <WeatherID>4</WeatherID>
                  <Desciption>Sunny</Desciption>
                  <Temperatures>
                     <MorningLow>64</MorningLow>
                     <DaytimeHigh>84</DaytimeHigh>
                  </Temperatures>
                  <ProbabilityOfPrecipiation>
                     <Nighttime>00</Nighttime>
                     <Daytime>00</Daytime>
                  </ProbabilityOfPrecipiation>
               </Forecast>
            </ForecastResult>
         </GetCityForecastByZIPResult>
      </GetCityForecastByZIPResponse>
   </soap:Body>
</soap:Envelope>
