QA stuff/4 Web Services testing/Lecture 5/result/SmokeTests-Loops-GetWeather__Use_random_ZIP_in_LA_State-0-OK.txt

Status: OK
Time Taken: 328
Size: 762
Timestamp: Mon May 30 01:04:42 EEST 2016
TestStep: GetWeather - Use random ZIP in LA State

----------------- Messages ------------------------------

----------------- Properties ------------------------------
Encoding: UTF-8
Endpoint: http://wsf.cdyne.com/WeatherWS/Weather.asmx

---------------- Request ---------------------------
Request Headers: Host : wsf.cdyne.com
Content-Length : 315
Accept-Encoding : gzip,deflate
User-Agent : Apache-HttpClient/4.1.1 (java 1.5)
Connection : Keep-Alive
Content-Type : application/soap+xml;charset=UTF-8;action="http://ws.cdyne.com/WeatherWS/GetCityWeatherByZIP"


<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:weat="http://ws.cdyne.com/WeatherWS/">
   <soap:Header/>
   <soap:Body>
      <weat:GetCityWeatherByZIP>
         <!--Optional:-->
         <weat:ZIP>80001</weat:ZIP>
      </weat:GetCityWeatherByZIP>
   </soap:Body>
</soap:Envelope>

---------------- Response --------------------------
Response Headers: X-AspNet-Version : 2.0.50727
Date : Sun, 29 May 2016 22:04:37 GMT
#status# : HTTP/1.1 200 OK
Content-Length : 762
Expires : -1
Content-Type : application/soap+xml; charset=utf-8
X-Powered-By : ASP.NET
Server : Microsoft-IIS/7.5
Pragma : no-cache
Cache-Control : no-cache


<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
   <soap:Body>
      <GetCityWeatherByZIPResponse xmlns="http://ws.cdyne.com/WeatherWS/">
         <GetCityWeatherByZIPResult>
            <Success>true</Success>
            <ResponseText>City Found</ResponseText>
            <State>CO</State>
            <City>Arvada</City>
            <WeatherStationCity>Broomfield</WeatherStationCity>
            <WeatherID>10</WeatherID>
            <Description>Mostly Sunny</Description>
            <Temperature>63</Temperature>
            <RelativeHumidity>31</RelativeHumidity>
            <Wind>W14G20</Wind>
            <Pressure>29.88R</Pressure>
            <Visibility/>
            <WindChill/>
            <Remarks/>
         </GetCityWeatherByZIPResult>
      </GetCityWeatherByZIPResponse>
   </soap:Body>
</soap:Envelope>
