AutomatedServiceValidatorAndAccelerator_V1.0/Test Execution Reports/TestRun_02-02-2016_101030/Request Response/TS001_GetCityForecastByZIPAll_WorkFlowRequest.txt

*******************************************************************************************************
TS001_GetCityForecastByZIPAll_TC002_GetCityForecastByZIP:DS1,TC002_GetCityForecastByZIP:DS2,Timestamp : 02/02/2016 10:10:30
*******************************************************************************************************************************************
*******************************************************************************************************************************************
TC002_GetCityForecastByZIP_DS1 Timestamp : 02/02/2016 10:10:31
*******************************************************************************************************************************************
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:weat="http://ws.cdyne.com/WeatherWS/">
   <soapenv:Header/>
   <soapenv:Body>
      <weat:GetCityForecastByZIP>
         <!--Optional:-->
         <weat:ZIP>94587</weat:ZIP>
      </weat:GetCityForecastByZIP>
   </soapenv:Body>
</soapenv:Envelope>
*******************************************************************************************************************************************
TC002_GetCityForecastByZIP_DS2 Timestamp : 02/02/2016 10:10:31
*******************************************************************************************************************************************
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:weat="http://ws.cdyne.com/WeatherWS/">
   <soapenv:Header/>
   <soapenv:Body>
      <weat:GetCityForecastByZIP>
         <!--Optional:-->
         <weat:ZIP>60070</weat:ZIP>
      </weat:GetCityForecastByZIP>
   </soapenv:Body>
</soapenv:Envelope>

