QA stuff/4 Web Services testing/Lecture 5/result/SmokeTests-DataDrivenTests-GetWeatherByZIP_DataDriven_calls_ot_SOAP_step-0-OK.txt

Status: OK
Time Taken: 222
Size: 756
Timestamp: Mon May 30 01:04:43 EEST 2016
TestStep: GetWeatherByZIP

----------------- Messages ------------------------------

----------------- Properties ------------------------------
Encoding: UTF-8
Endpoint: http://wsf.cdyne.com/WeatherWS/Weather.asmx

---------------- Request ---------------------------
Request Headers: Host : wsf.cdyne.com
Content-Length : 315
Accept-Encoding : gzip,deflate
User-Agent : Apache-HttpClient/4.1.1 (java 1.5)
Connection : Keep-Alive
Content-Type : application/soap+xml;charset=UTF-8;action="http://ws.cdyne.com/WeatherWS/GetCityWeatherByZIP"


<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:weat="http://ws.cdyne.com/WeatherWS/">
   <soap:Header/>
   <soap:Body>
      <weat:GetCityWeatherByZIP>
         <!--Optional:-->
         <weat:ZIP>90001</weat:ZIP>
      </weat:GetCityWeatherByZIP>
   </soap:Body>
</soap:Envelope>

---------------- Response --------------------------
Response Headers: X-AspNet-Version : 2.0.50727
Date : Sun, 29 May 2016 22:04:38 GMT
#status# : HTTP/1.1 200 OK
Content-Length : 756
Expires : -1
Content-Type : application/soap+xml; charset=utf-8
X-Powered-By : ASP.NET
Server : Microsoft-IIS/7.5
Pragma : no-cache
Cache-Control : no-cache


<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
   <soap:Body>
      <GetCityWeatherByZIPResponse xmlns="http://ws.cdyne.com/WeatherWS/">
         <GetCityWeatherByZIPResult>
            <Success>true</Success>
            <ResponseText>City Found</ResponseText>
            <State>CA</State>
            <City>Los Angeles</City>
            <WeatherStationCity>Hawthorne</WeatherStationCity>
            <WeatherID>4</WeatherID>
            <Description>Sunny</Description>
            <Temperature>72</Temperature>
            <RelativeHumidity>61</RelativeHumidity>
            <Wind>CALM</Wind>
            <Pressure>29.87S</Pressure>
            <Visibility/>
            <WindChill/>
            <Remarks/>
         </GetCityWeatherByZIPResult>
      </GetCityWeatherByZIPResponse>
   </soap:Body>
</soap:Envelope>
